Hi There, 

I apologize for the oversight in providing additional details. I have successfully identified the cause. But no idea how to fix this. 

Here is sample: 

```hcl
resource "oci_objectstorage_bucket" "bucket" {
  compartment_id = data.oci_identity_compartment.environment_compartment.id
  name           = "TestBucket"
  namespace      = data.oci_objectstorage_namespace.this.namespace
  access_type    = "NoPublicAccess"
}

resource "oci_objectstorage_object" "test-object" {
  bucket    = oci_objectstorage_bucket.bucket.name
  namespace = data.oci_objectstorage_namespace.this.namespace
  object    = "testObject.txt"
  content = "6"
}

resource "oci_objectstorage_object" "test-object2" {
  depends_on = [
    oci_objectstorage_object.test-object
  ]
  bucket    = oci_objectstorage_bucket.bucket.name
  namespace = data.oci_objectstorage_namespace.this.namespace
  object    = "testObject2.txt"
  content = "2"
  lifecycle {
    create_before_destroy = true
  }
}
```

The resource “test-object2” above is simply used to produce the same behavior. In fact, I have an “oci_core_instance_configuration” that depends on an “object storage object.” The instance configuration has the “create_before_destroy” set to “true,” which is necessary to keep updating it while it’s being used by the instance pool.

Therefore, when something with “create_before_destroy” set to “true” depends on “test-object,” “test-object” will be created, then destroyed, resulting in its actual deletion. 


So this is first run after change test-object content: 

```
Terraform will perform the following actions:

  # oci_objectstorage_object.test-object must be replaced
+/- resource "oci_objectstorage_object" "test-object" {
      ~ content                    = "c9f0f895fb98ab9159f51fd0297e236d" -> "45c48cce2e2d7fbdea1afc51c7c6ad26" # forces replacement
      ~ content_length             = "1" -> (known after apply)
      ~ content_md5                = "yfD4lfuYq5FZ9R/QKX4jbQ==" -> (known after apply)
      ~ content_type               = "application/octet-stream" -> (known after apply)
      ~ id                         = "n/<REDACTED>/b/TestBucket/o/testObject.txt" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "22b0ecb7-2b41-46be-bfda-2ffcfdebc68e" -> (known after apply)
      + work_request_id            = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_objectstorage_object.test-object: Creating...
oci_objectstorage_object.test-object: Creation complete after 1s [id=n/<REDACTED>/b/TestBucket/o/testObject.txt]
oci_objectstorage_object.test-object (deposed object e366de59): Destroying... [id=n/<REDACTED>/b/TestBucket/o/testObject.txt]
oci_objectstorage_object.test-object: Destruction complete after 0s
```

So, here we can see - a new one created, a that deposed object has been destroyed. In fact, now object has gone. 
Here is the second run: 

```
Terraform will perform the following actions:

  # oci_objectstorage_object.test-object will be created
  + resource "oci_objectstorage_object" "test-object" {
      + bucket                     = "TestBucket"
      + content                    = "45c48cce2e2d7fbdea1afc51c7c6ad26"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = (known after apply)
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "<REDACTED>"
      + object                     = "testObject.txt"
      + opc_sse_kms_key_id         = (known after apply)
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_objectstorage_object.test-object: Creating...
oci_objectstorage_object.test-object: Creation complete after 1s [id=n/<REDACTED>/b/TestBucket/o/testObject.txt]
```


Just one suggestion here - maybe for content update, instead of deleting and creating the object, patch/update should be used by provider internally? If object is updated in place, perhaps it would solve the issue. 